leandroschwarz/funsapeLib/_stuff/old_projects/STM32_STM32F103C8Tx_tftExample_1/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define NLED_Pin					GPIO_PIN_13
#define NLED_GPIO_Port				GPIOC

#define TFT_DB8_Pin					GPIO_PIN_0
#define TFT_DB8_GPIO_Port			GPIOA
#define TFT_DB9_Pin					GPIO_PIN_1
#define TFT_DB9_GPIO_Port			GPIOA
#define TFT_DB10_Pin				GPIO_PIN_2
#define TFT_DB10_GPIO_Port			GPIOA
#define TFT_DB11_Pin				GPIO_PIN_3
#define TFT_DB11_GPIO_Port			GPIOA
#define TFT_DB12_Pin				GPIO_PIN_4
#define TFT_DB12_GPIO_Port			GPIOA
#define TFT_DB13_Pin				GPIO_PIN_5
#define TFT_DB13_GPIO_Port			GPIOA
#define TFT_DB14_Pin				GPIO_PIN_6
#define TFT_DB14_GPIO_Port			GPIOA
#define TFT_DB15_Pin				GPIO_PIN_7
#define TFT_DB15_GPIO_Port			GPIOA

#define TFT_RD_Pin					GPIO_PIN_8
#define TFT_RD_GPIO_Port			GPIOA
#define TFT_WR_Pin					GPIO_PIN_9
#define TFT_WR_GPIO_Port			GPIOA
#define TFT_RS_Pin					GPIO_PIN_10
#define TFT_RS_GPIO_Port			GPIOA
#define TFT_CS_Pin					GPIO_PIN_11
#define TFT_CS_GPIO_Port			GPIOA
#define TFT_REST_Pin				GPIO_PIN_12
#define TFT_REST_GPIO_Port			GPIOA
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
